Duet3D/Duet3Expansion/src/atmel/SAMD20_DFP/1.2.91/samd20b/atdf/ATSAMD20E16B.atdf
    <module name="FUSES" id="U2207" version="1.0.9" caption="Non-Volatile Fuses">
      <register-group name="OTP4_FUSES">
        <register name="OTP4_WORD_0" offset="0x0" size="4" rw="R" caption="OTP4 Page Word 0">
          <bitfield name="ADC_LINEARITY_0" caption="ADC Linearity bits 4:0" mask="0xF8000000"/>
        </register>
        <register name="OTP4_WORD_1" offset="0x4" size="4" rw="R" caption="OTP4 Page Word 1">
          <bitfield name="ADC_LINEARITY_1" caption="ADC Linearity bits 7:5" mask="0x7"/>
          <bitfield name="ADC_BIASCAL" caption="ADC Bias Calibration" mask="0x38"/>
          <bitfield name="OSC32KCAL" caption="OSC32K Calibration" mask="0x1FC0"/>
          <bitfield name="DFLL48M_COARSE_CAL" caption="DFLL48M Coarse Calibration" mask="0xFC000000"/>
        </register>
        <register name="OTP4_WORD_2" offset="0x8" size="4" rw="R" caption="OTP4 Page Word 2">
          <bitfield name="DFLL48M_FINE_CAL" caption="DFLL48M Fine Calibration" mask="0x3FF"/>
        </register>
      </register-group>
      <register-group name="TEMP_LOG_FUSES">
        <register name="TEMP_LOG_WORD_0" offset="0x0" size="4" rw="R" caption="TEMP_LOG Page Word 0">
          <bitfield name="NVMCTRL_ROOM_TEMP_VAL_INT" caption="Integer part of room temperature in oC" mask="0xFF"/>
          <bitfield name="NVMCTRL_ROOM_TEMP_VAL_DEC" caption="Decimal part of room temperature" mask="0xF00"/>
          <bitfield name="NVMCTRL_HOT_TEMP_VAL_INT" caption="Integer part of hot temperature in oC" mask="0xFF000"/>
          <bitfield name="NVMCTRL_HOT_TEMP_VAL_DEC" caption="Decimal part of hot temperature" mask="0xF00000"/>
          <bitfield name="NVMCTRL_ROOM_INT1V_VAL" caption="2's complement of the internal 1V reference drift at room temperature (versus a 1.0 centered value)" mask="0xFF000000"/>
        </register>
        <register name="TEMP_LOG_WORD_1" offset="0x4" size="4" rw="R" caption="TEMP_LOG Page Word 1">
          <bitfield name="NVMCTRL_HOT_INT1V_VAL" caption="2's complement of the internal 1V reference drift at hot temperature (versus a 1.0 centered value)" mask="0xFF"/>
          <bitfield name="NVMCTRL_ROOM_ADC_VAL" caption="12-bit ADC conversion at room temperature" mask="0xFFF00"/>
          <bitfield name="NVMCTRL_HOT_ADC_VAL" caption="12-bit ADC conversion at hot temperature" mask="0xFFF00000"/>
        </register>
      </register-group>
      <register-group name="USER_FUSES">
        <register name="USER_WORD_0" offset="0x0" size="4" rw="RW" caption="USER Page Word 0">
          <bitfield name="NVMCTRL_BOOTPROT" caption="Bootloader Size" mask="0x7"/>
          <bitfield name="NVMCTRL_EEPROM_SIZE" caption="EEPROM Size" mask="0x70"/>
          <bitfield name="BOD33USERLEVEL" caption="BOD33 User Level" mask="0x3F00"/>
          <bitfield name="BOD33_EN" caption="BOD33 Enable" mask="0x4000"/>
          <bitfield name="BOD33_ACTION" caption="BOD33 Action" mask="0x18000"/>
          <bitfield name="WDT_ENABLE" caption="WDT Enable" mask="0x2000000"/>
          <bitfield name="WDT_ALWAYSON" caption="WDT Always On" mask="0x4000000"/>
          <bitfield name="WDT_PER" caption="WDT Period" mask="0x78000000"/>
          <bitfield name="WDT_WINDOW_0" caption="WDT Window bit 0" mask="0x80000000"/>
        </register>
        <register name="USER_WORD_1" offset="0x4" size="4" rw="RW" caption="USER Page Word 1">
          <bitfield name="WDT_WINDOW_1" caption="WDT Window bits 3:1" mask="0x7"/>
          <bitfield name="WDT_EWOFFSET" caption="WDT Early Warning Offset" mask="0x78"/>
          <bitfield name="WDT_WEN" caption="WDT Window Mode Enable" mask="0x80"/>
          <bitfield name="BOD33_HYST" caption="BOD33 Hysteresis" mask="0x100"/>
          <bitfield name="NVMCTRL_REGION_LOCKS" caption="NVM Region Locks" mask="0xFFFF0000"/>
        </register>
      </register-group>
    </module>
    <module name="PAC" id="U2211" version="1.0.1" caption="Peripheral Access Controller">
      <register-group name="PAC" caption="Peripheral Access Controller">
        <register name="WPCLR" offset="0x0" rw="RW" size="4" atomic-op="clear:WPCLR" initval="0x00000000" caption="Write Protection Clear">
          <bitfield name="WP" caption="Write Protection Clear" mask="0xFFFFFFFE"/>
        </register>
        <register name="WPSET" offset="0x4" rw="RW" size="4" atomic-op="set:WPSET" initval="0x00000000" caption="Write Protection Set">
          <bitfield name="WP" caption="Write Protection Set" mask="0xFFFFFFFE"/>
        </register>
      </register-group>
    </module>
    <module name="PM" id="U2206" version="2.0.2" caption="Power Manager">
      <register-group name="PM" caption="Power Manager">
        <register name="CTRL" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control">
        </register>
        <register name="SLEEP" offset="0x1" rw="RW" size="1" initval="0x00" caption="Sleep Mode">
          <bitfield name="IDLE" caption="Idle Mode Configuration" mask="0x3" values="PM_SLEEP__IDLE"/>
        </register>
        <register name="CPUSEL" offset="0x8" rw="RW" size="1" initval="0x00" caption="CPU Clock Select">
          <bitfield name="CPUDIV" caption="CPU Prescaler Selection" mask="0x7" values="PM_CPUSEL__CPUDIV"/>
        </register>
        <register name="APBASEL" offset="0x9" rw="RW" size="1" initval="0x00" caption="APBA Clock Select">
          <bitfield name="APBADIV" caption="APBA Prescaler Selection" mask="0x7" values="PM_APBASEL__APBADIV"/>
        </register>
        <register name="APBBSEL" offset="0xA" rw="RW" size="1" initval="0x00" caption="APBB Clock Select">
          <bitfield name="APBBDIV" caption="APBB Prescaler Selection" mask="0x7" values="PM_APBBSEL__APBBDIV"/>
        </register>
        <register name="APBCSEL" offset="0xB" rw="RW" size="1" initval="0x00" caption="APBC Clock Select">
          <bitfield name="APBCDIV" caption="APBC Prescaler Selection" mask="0x7" values="PM_APBCSEL__APBCDIV"/>
        </register>
        <register name="AHBMASK" offset="0x14" rw="RW" size="4" initval="0x0000001F" caption="AHB Mask">
          <bitfield name="HPB0_" caption="HPB0 AHB Clock Mask" mask="0x1"/>
          <bitfield name="HPB1_" caption="HPB1 AHB Clock Mask" mask="0x2"/>
          <bitfield name="HPB2_" caption="HPB2 AHB Clock Mask" mask="0x4"/>
          <bitfield name="DSU_" caption="DSU AHB Clock Mask" mask="0x8"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL AHB Clock Mask" mask="0x10"/>
        </register>
        <register name="APBAMASK" offset="0x18" rw="RW" size="4" initval="0x0000007F" caption="APBA Mask">
          <bitfield name="PAC0_" caption="PAC0 APB Clock Enable" mask="0x1"/>
          <bitfield name="PM_" caption="PM APB Clock Enable" mask="0x2"/>
          <bitfield name="SYSCTRL_" caption="SYSCTRL APB Clock Enable" mask="0x4"/>
          <bitfield name="GCLK_" caption="GCLK APB Clock Enable" mask="0x8"/>
          <bitfield name="WDT_" caption="WDT APB Clock Enable" mask="0x10"/>
          <bitfield name="RTC_" caption="RTC APB Clock Enable" mask="0x20"/>
          <bitfield name="EIC_" caption="EIC APB Clock Enable" mask="0x40"/>
        </register>
        <register name="APBBMASK" offset="0x1C" rw="RW" size="4" initval="0x0000001F" caption="APBB Mask">
          <bitfield name="PAC1_" caption="PAC1 APB Clock Enable" mask="0x1"/>
          <bitfield name="DSU_" caption="DSU APB Clock Enable" mask="0x2"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL APB Clock Enable" mask="0x4"/>
          <bitfield name="PORT_" caption="PORT APB Clock Enable" mask="0x8"/>
        </register>
        <register name="APBCMASK" offset="0x20" rw="RW" size="4" initval="0x00010000" caption="APBC Mask">
          <bitfield name="PAC2_" caption="PAC2 APB Clock Enable" mask="0x1"/>
          <bitfield name="EVSYS_" caption="EVSYS APB Clock Enable" mask="0x2"/>
          <bitfield name="SERCOM0_" caption="SERCOM0 APB Clock Enable" mask="0x4"/>
          <bitfield name="SERCOM1_" caption="SERCOM1 APB Clock Enable" mask="0x8"/>
          <bitfield name="SERCOM2_" caption="SERCOM2 APB Clock Enable" mask="0x10"/>
          <bitfield name="SERCOM3_" caption="SERCOM3 APB Clock Enable" mask="0x20"/>
          <bitfield name="TC0_" caption="TC0 APB Clock Enable" mask="0x100"/>
          <bitfield name="TC1_" caption="TC1 APB Clock Enable" mask="0x200"/>
          <bitfield name="TC2_" caption="TC2 APB Clock Enable" mask="0x400"/>
          <bitfield name="TC3_" caption="TC3 APB Clock Enable" mask="0x800"/>
          <bitfield name="TC4_" caption="TC4 APB Clock Enable" mask="0x1000"/>
          <bitfield name="TC5_" caption="TC5 APB Clock Enable" mask="0x2000"/>
          <bitfield name="ADC_" caption="ADC APB Clock Enable" mask="0x10000"/>
          <bitfield name="AC_" caption="AC APB Clock Enable" mask="0x20000"/>
          <bitfield name="DAC_" caption="DAC APB Clock Enable" mask="0x40000"/>
          <bitfield name="PTC_" caption="PTC APB Clock Enable" mask="0x80000"/>
        </register>
